let res = 0
if (prompt('1. Решите пример: 16*16=','0')==='256') {
    res += 0.5
}
if (prompt('2. Решите пример: 2+2*2=','0')==='6') {
    res += 0.5
}
if (prompt('3. Решите пример: 75*5=','0')==='375') {
    res += 0.5
}
if (prompt('4. Решите пример: 64/2+90=','0')==='122') {
    res += 0.5
}
if (prompt('5. Решите пример: 186/3=','0')==='62') {
    res += 0.5
}
if (prompt('6. Решите пример: 3*5=','0')==='15') {
    res += 0.5
}
if (prompt('7. Решите пример: 43*2=','0')==='86') {
    res += 0.5
}
if (prompt('8. Решите пример: 99/3=','0')==='33') {
    res += 0.5
}
if (prompt('9. Решите пример: 11*11=','0')==='121') {
    res += 0.5
}
if (prompt('10. Решите пример: 6*8=','0')==='48') {
    res += 0.5
}
alert('Ваша оценка: ' + res)